In [1]:
import pandas as pd
import numpy as np
%matplotlib inline

In [2]:
data_set = pd.read_csv("Social_Network_Ads.csv")

In [3]:
data_set.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
Gender = pd.get_dummies(data_set[['Gender']] , drop_first=True)

In [5]:
Gender.head(10)

   Gender_Male
0            1
1            1
2            0
3            0
4            1
5            1
6            0
7            0
8            1
9            0

In [6]:
data_set = pd.concat([data_set,Gender] ,axis=1)

In [7]:
data_set.head()

    User ID  Gender  Age  EstimatedSalary  Purchased  Gender_Male
0  15624510    Male   19            19000          0            1
1  15810944    Male   35            20000          0            1
2  15668575  Female   26            43000          0            0
3  15603246  Female   27            57000          0            0
4  15804002    Male   19            76000          0            1

In [8]:
data_set.drop(['Gender'] , axis=1 , inplace=True)

In [9]:
data_set.head()

    User ID  Age  EstimatedSalary  Purchased  Gender_Male
0  15624510   19            19000          0            1
1  15810944   35            20000          0            1
2  15668575   26            43000          0            0
3  15603246   27            57000          0            0
4  15804002   19            76000          0            1

In [10]:
data_set = data_set[['User ID','Age','Gender_Male','EstimatedSalary','Purchased']]

In [11]:
data_set.head()

    User ID  Age  Gender_Male  EstimatedSalary  Purchased
0  15624510   19            1            19000          0
1  15810944   35            1            20000          0
2  15668575   26            0            43000          0
3  15603246   27            0            57000          0
4  15804002   19            1            76000          0

In [12]:
x = data_set.iloc[:,[1,2,3]].values
y = data_set.iloc[:,[4]].values

In [13]:
from sklearn.model_selection import train_test_split

x_train,x_test,y_train,y_test = train_test_split(x,y,test_size = 0.3,random_state = 0)

In [14]:
from sklearn.preprocessing import StandardScaler

stc =StandardScaler()
x_train = stc.fit_transform(x_train)
x_test = stc.transform(x_test)

In [15]:
from sklearn.naive_bayes import GaussianNB

y_train = y_train.ravel() #Putted to avoid -> DataConversionWarning: A column-vector y was passed when a 1d array was expected.
#Please change the shape of y to (n_samples,), for example using ravel().


classifier = GaussianNB()
classifier.fit(x_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [16]:
y_pred = classifier.predict(x_test)

In [17]:
df = pd.DataFrame({'Actual':y_test.flatten() , 'Predicted':y_pred.flatten()})

In [18]:
df.head()

   Actual  Predicted
0       0          0
1       0          0
2       0          0
3       0          0
4       0          0

In [19]:
from sklearn.metrics import accuracy_score , confusion_matrix , classification_report

print(f"Accuracy : \n{accuracy_score(y_test,y_pred)*100}\n*********************************")
print(f"Confusion Matrix : \n{confusion_matrix(y_test,y_pred)}\n*********************************")
print(f"Classification Report : \n{classification_report(y_test,y_pred)}\n******************************************************************")

Accuracy :
90.83333333333333
*********************************
Confusion Matrix :
[[76  3]
 [ 8 33]]
*********************************
Classification Report :
              precision    recall  f1-score   support

           0       0.90      0.96      0.93        79
           1       0.92      0.80      0.86        41

    accuracy                           0.91       120
   macro avg       0.91      0.88      0.89       120
weighted avg       0.91      0.91      0.91       120

******************************************************************